In [44]:
import pandas as pd
import numpy as np
# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [2]:
df.iloc[1, 0]

1

In [5]:
df.iloc[:, 2]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [7]:
df.iloc[-2:,]

   A   B   C
3  3  13  23
4  4  14  24

In [8]:
df.iloc[:3, :2]

   A   B
0  0  10
1  1  11
2  2  12

In [9]:
df.iloc[0: len(df)-1 : 2, -1]

0    20
2    22
Name: C, dtype: int64

In [12]:
df.iloc[::2, -1]

0    20
2    22
4    24
Name: C, dtype: int64

In [13]:
df.iloc[::-1, :]

   A   B   C
4  4  14  24
3  3  13  23
2  2  12  22
1  1  11  21
0  0  10  20

In [14]:
df.iloc[::-1, ::-1]

    C   B  A
4  24  14  4
3  23  13  3
2  22  12  2
1  21  11  1
0  20  10  0

In [16]:
df.iloc[-2,:]

A     3
B    13
C    23
Name: 3, dtype: int64

In [20]:
df.iloc[[0,2] , [1, 2]]

    B   C
0  10  20
2  12  22

In [21]:
df.iloc[:, :3]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [22]:
df.iloc[:2, ::2]

   A   C
0  0  20
1  1  21

In [23]:
df.iloc[-3:, -1]

2    22
3    23
4    24
Name: C, dtype: int64

In [24]:
df.iloc[:4, :-1]

   A   B
0  0  10
1  1  11
2  2  12
3  3  13

In [27]:
df.iloc[[1, 3], 0]

1    1
3    3
Name: A, dtype: int64

In [30]:
df.iloc[:, 2]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [31]:
df.iloc[:, ::-1]

    C   B  A
0  20  10  0
1  21  11  1
2  22  12  2
3  23  13  3
4  24  14  4

In [33]:
df.iloc[1::2, 1:3]

    B   C
1  11  21
3  13  23

In [34]:
df.iloc[:-2, 1]

0    10
1    11
2    12
Name: B, dtype: int64

In [36]:
df.iloc[2:5, 0]

2    2
3    3
4    4
Name: A, dtype: int64

In [37]:
df.iloc[:3, ::-1]

    C   B  A
0  20  10  0
1  21  11  1
2  22  12  2

In [38]:
df.iloc[:,1::2]

    B
0  10
1  11
2  12
3  13
4  14

In [39]:
def get_mean(given_series):
    return np.mean(given_series)

In [47]:
df['Mean'] = df.loc[:,:].apply(get_mean, axis =1)

C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_11836\1220531606.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Mean'] = df.loc[:,:].apply(get_mean, axis =1)